DataProcessors/МониторСверкиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МониторСверкиВзаиморасчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КомментарииСверкиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КомментарииСверкиВзаиморасчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИНН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНДСПоСтавкам4и2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеМеждународное</Name>
					<Comment>Наименование в латинской транскрипции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВТранскрипции</Name>
					<Comment>Наименование в русской транскрипции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>550</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияКПП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияНаименований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СокращенноеНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/МониторСверкиВзаиморасчетов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	//Инициализировать форму
	ИспользоватьПартнеровКакКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов");
	ЗаполнитьСписокОрганизаций();
	ЗаполнитьТипыРасчетов();
	ЗаполнитьСтатусыСверки();
	АвтообновлениеСпискаПриИзмененииНастроек = Истина;
	ЗапускИзКонфигурации = ТипЗнч(РеквизитФормыВЗначение("Объект")) = Тип("ОбработкаОбъект.МониторСверкиВзаиморасчетов");
	//++ Локализация
	Элементы.СверкаСКонтрагентамиГруппаСверка20.Видимость = ПолучитьФункциональнуюОпциюФормы("ИспользуетсяСервисСверкиРасчетов");
	//-- Локализация
	
	ОтчетыРасшифровки.Добавить(Метаданные.Отчеты.ВедомостьРасчетовСКлиентами.Имя, Метаданные.Отчеты.ВедомостьРасчетовСКлиентами.Синоним);//0
	ОтчетыРасшифровки.Добавить(Метаданные.Отчеты.ВедомостьРасчетовСПоставщиками.Имя, Метаданные.Отчеты.ВедомостьРасчетовСПоставщиками.Синоним);//1
	ОтчетыРасшифровки.Добавить(Метаданные.Отчеты.ВедомостьРасчетовПоФинансовымИнструментам.Имя, Метаданные.Отчеты.ВедомостьРасчетовПоФинансовымИнструментам.Синоним);//2
	ОтчетыРасшифровки.Добавить(Метаданные.Отчеты.ВедомостьРасчетовМеждуОрганизациями.Имя, Метаданные.Отчеты.ВедомостьРасчетовМеждуОрганизациями.Синоним);//3
	ОтчетыРасшифровки.Добавить(Метаданные.Отчеты.ВедомостьРасчетовСПартнерами.Имя, Метаданные.Отчеты.ВедомостьРасчетовСПартнерами.Синоним);//4
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаГлобальныеКоманды);
	// Конец ИнтеграцияС1СДокументооборотом
	
	Элементы.СписокКонтрагентов.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УстановитьВидимостьБыстрыхОтборов(Элементы.БыстрыеОтборы, Элементы.ГруппаОтборы, ПоказыватьБыстрыеОтборы);
	УстановитьДатуОстатков(Элементы.СверкаСКонтрагентамиГруппаОстатки, Настройки["Объект.КонецПериода"]);
	УстановитьВидимостьСервисов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если АвтообновлениеСпискаПриИзмененииНастроек 
			И ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.КонецПериода)
			И ЗначениеЗаполнено(Объект.Организация) Тогда
		ПодключитьОбработчикОжидания("ЗаполнитьПоДаннымРасчетовСОжиданием", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	УстановитьДатуОстатков(Элементы.СверкаСКонтрагентамиГруппаОстатки, Объект.КонецПериода);
	ПриИзмененииНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьВидимостьСервисов();
	ПриИзмененииНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ЭтоНашаОрганизацияПриИзменении(Элемент)
	
	Если ЭтоНашаОрганизация Тогда
		Элементы.СписокКонтрагентов.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Организации");
	Иначе
		Элементы.СписокКонтрагентов.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	КонецЕсли;
	Элементы.СверкаСКонтрагентамиМенеджер.Видимость = НЕ ЭтоНашаОрганизация;
	СписокКонтрагентов.Очистить();
	ПриИзмененииНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтрагентовПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ВключатьДоговорыБезОборотовПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ЕстьРасхожденияПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТипыРасчетов

&НаКлиенте
Процедура ТипыРасчетовПриАктивизацииСтроки(Элемент)
	Элементы.ТипыРасчетов.ВыделенныеСтроки.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ТипыРасчетовИспользованиеПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтатусыСверки

&НаКлиенте
Процедура СтатусыСверкиПриАктивизацииСтроки(Элемент)
	Элементы.СтатусыСверки.ВыделенныеСтроки.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура СтатусыСверкиИспользованиеПриИзменении(Элемент)
	ПриИзмененииНастройки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСверкаСКонтрагентами

&НаКлиенте
Процедура СверкаСКонтрагентамиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗапускИзКонфигурации Тогда
		ОбъектФормы = "Обработка.";
	Иначе
		ОбъектФормы = "ВнешняяОбработка.";
	КонецЕсли;
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура);
	ПараметрыФормы.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыФормы.Вставить("НачалоПериода", Объект.НачалоПериода);
	ПараметрыФормы.Вставить("КонецПериода", Объект.КонецПериода);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Контрагент", ТекущаяСтрока.Контрагент);
	ПараметрыФормы.Вставить("Менеджер", ТекущаяСтрока.Менеджер);
	ПараметрыФормы.Вставить("Валюта", ТекущаяСтрока.Валюта);
	ПараметрыФормы.Вставить("ВключатьДоговорыБезОборотов", ВключатьДоговорыБезОборотов);
	ТипыРасчетов = Новый Массив;
	Для Каждого Отбор Из ОтборТипыРасчетов Цикл
		Если Отбор.Использование Тогда
			ТипыРасчетов.Добавить(Отбор.ТипРасчетов);
		КонецЕсли;
	КонецЦикла;
	ПараметрыФормы.Вставить("ТипыРасчетов", ТипыРасчетов);
	//++ Локализация
	ПараметрыФормы.Вставить("УчастникЭДО", ТекущаяСтрока.УчастникЭДО);
	//-- Локализация
	
	Если Поле.Имя = "СверкаСКонтрагентамиКонтрагент" Тогда
		ОткрытьЗначениеАсинх(ТекущаяСтрока.Контрагент);
		
	ИначеЕсли Поле.Имя = "СверкаСКонтрагентамиДолгКонтрагента"
			ИЛИ Поле.Имя = "СверкаСКонтрагентамиНашДолг" Тогда
		ОткрытьВедомостьРасчетов(Элемент, ТекущаяСтрока);
	
	ИначеЕсли (Поле.Имя = "СверкаСКонтрагентамиСтатусСверкиПредставление"
			ИЛИ Поле.Имя = "СверкаСКонтрагентамиСверка20") Тогда
		ОткрытьФорму(ОбъектФормы + "МониторСверкиВзаиморасчетов.Форма.СостояниеСверки",ПараметрыФормы,,Истина);
	//++ Локализация
	ИначеЕсли Поле.Имя = "СверкаСКонтрагентамиНеПолученыДокументыПоЭДО" И ТекущаяСтрока.НеЗавершенОбменЭДОКоличество > 0 Тогда
		ОткрытьФорму(ОбъектФормы + "МониторСверкиВзаиморасчетов.Форма.ДокументыНеПолученныеПоЭДО",ПараметрыФормы,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//-- Локализация
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СверкаСКонтрагентамиКомментарийТекстПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СверкаСКонтрагентами.ТекущиеДанные;
	Отбор = Новый Структура("Контрагент", ТекущаяСтрока.Контрагент);
	НайденныеСтроки = СверкаСКонтрагентами.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 1 Тогда
		Для Каждого Строка Из НайденныеСтроки Цикл
			Строка.Комментарий = ТекущаяСтрока.Комментарий;
		КонецЦикла;
	КонецЕсли;
	ЗаписатьКомментарийНаСревере(ТекущаяСтрока.Контрагент, ТекущаяСтрока.Комментарий);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьИнтервалПериода(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("УстановитьИнтервалЗавершение", ЭтотОбъект);
	ПараметрыПериода = Новый Структура("ДатаНачала, ДатаОкончания", "НачалоПериода", "КонецПериода");
	ОбщегоНазначенияУТКлиент.РедактироватьПериод(Объект, ПараметрыПериода, ОповещениеОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеСверки(Команда)
	
	ОчиститьСообщения();
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		ТекстСообщение = НСтр("ru = 'Не указано ""Начало периода""'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщение,,"НачалоПериода","Объект.НачалоПериода",Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		ТекстСообщение = НСтр("ru = 'Не указан ""Конец периода""'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщение,,"КонецПериода","Объект.КонецПериода",Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщение = НСтр("ru = 'Не указана ""Организация""'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщение,,"Организация","Объект.Организация",Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ЗаполнитьПоДаннымРасчетов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБыстрыеОтборы(Команда)
	
	ПоказыватьБыстрыеОтборы = НЕ Элементы.ГруппаОтборы.Видимость;
	УстановитьВидимостьБыстрыхОтборов(Элементы.БыстрыеОтборы, Элементы.ГруппаОтборы, ПоказыватьБыстрыеОтборы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументСверки(Команда)
	
	СоздатьДокументСверкиВзаиморасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПомощникСозданияСверки(Команда)
	
	ОчиститьСообщения();
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.СверкаСКонтрагентами.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Контрагент", СписокКонтрагентов);
	ПараметрыФормы.Вставить("НачалоПериода", Объект.НачалоПериода);
	ПараметрыФормы.Вставить("КонецПериода", Объект.КонецПериода);
	ПараметрыФормы.Вставить("ДоговорыБезОборотов", ВключатьДоговорыБезОборотов);
	ПараметрыФормы.Вставить("ОсновнойМенеджер", Менеджер);
	ПараметрыФормы.Вставить("ЗаменитьНастройкиФормы", Истина);
	ВыбраныеТипыРасчетов = Новый СписокЗначений;
	Для Каждого Отбор Из ОтборТипыРасчетов Цикл
		Если Отбор.Использование Тогда
			ВыбраныеТипыРасчетов.Добавить(Отбор.ТипРасчетов);
		КонецЕсли;
	КонецЦикла;
	ПараметрыФормы.Вставить("ТипыРасчетов", ВыбраныеТипыРасчетов);
	
	ОткрытьФорму("Документ.СверкаВзаиморасчетов2_5_11.Форма.ФормаПомощникаСоздания", ПараметрыФормы);
	
КонецПроцедуры

#Область УстановкаСтатуса

&НаКлиенте
Процедура УстановитьСтатусСоздана(Команда)
	УстановитьСтатусСверки("Создана");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусНаСверке(Команда)
	УстановитьСтатусСверки("НаСверке");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусСверенаСРазногласиями(Команда)
	УстановитьСтатусСверки("СверенаСРазногласиями");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусСверенаБезРазногласий(Команда)
	УстановитьСтатусСверки("СверенаБезРазногласий");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусОтклонена(Команда)
	УстановитьСтатусСверки("Отклонена");
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КомментарийСверки(Команда)
	
	Если ЗапускИзКонфигурации Тогда
		ОбъектФормы = "Обработка.";
	Иначе
		ОбъектФормы = "ВнешняяОбработка.";
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.СверкаСКонтрагентами.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбран контрагент'"));
		Возврат;
	КонецЕсли;
	
	ПарамерыФормы = Новый Структура("Комментарий", ТекущаяСтрока.Комментарий);
	ДополнительныеПараметры = Новый Структура("Контрагент", ТекущаяСтрока.Контрагент);
	ОбработчикЗакрытия = Новый ОписаниеОповещения("ЗакрытиеФормыКоментарияЗавершение",ЭтотОбъект,ДополнительныеПараметры);
	ОткрытьФорму(ОбъектФормы + "МониторСверкиВзаиморасчетов.Форма.КомментарийСверки",ПарамерыФормы,,,,,ОбработчикЗакрытия,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыКоментарияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Контрагент", ДополнительныеПараметры.Контрагент);
	НайденныеСтроки = СверкаСКонтрагентами.НайтиСтроки(Отбор);
	Для Каждого Строка Из НайденныеСтроки Цикл
		Строка.Комментарий = Результат;
	КонецЦикла;
	ЗаписатьКомментарийНаСревере(ДополнительныеПараметры.Контрагент, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросНаСверку(Команда)
	
	ИдентификаторТекущейСтроки = Элементы.СверкаСКонтрагентами.ТекущаяСтрока;
	Если ИдентификаторТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтправкиПисьма = РаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма();
	
	ЗаполнитьПараметрыОтправкиПисьмаНаСервере(ПараметрыОтправкиПисьма, ИдентификаторТекущейСтроки);
	
	РаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправкиПисьма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//НашДолг
	
	// Если конечный долг равен 0
	//  и есть обороты или есть развернутое сальдо, 
	//то выведем ноль для открытия расшифровочного отчета
	Элемент = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(Элемент.Поля, "СверкаСКонтрагентамиНашДолг");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"СверкаСКонтрагентами.ДолгКонтрагента", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"СверкаСКонтрагентами.НашДолг", ВидСравненияКомпоновкиДанных.Равно, 0);
	ГруппаОтбораИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Элемент.Отбор,"ЕстьОстаткиИлиОбороты",ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИЛИ,
			"СверкаСКонтрагентами.ЕстьРазвернутыйОстаток", ВидСравненияКомпоновкиДанных.Равно, Истина);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИЛИ,
			"СверкаСКонтрагентами.ЕстьОбороты", ВидСравненияКомпоновкиДанных.Равно, Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "0");
	
	// Если сальдо нулевое и не было оборотов, то выведем просто подсказку, что не было операций.
	// В этом случае скроем гиперссылку НашДолг, а вместо этого выведем колонку с текстом пояснения.
	
	//скроем колонку остатка
	Элемент = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(Элемент.Поля, "СверкаСКонтрагентамиНашДолг");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"СверкаСКонтрагентами.ЕстьРазвернутыйОстаток", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"СверкаСКонтрагентами.ЕстьОбороты", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//выведем текст подсказки
	Элемент = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(Элемент.Поля, "СверкаСКонтрагентамиНашДолгНетОпераций");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"СверкаСКонтрагентами.ЕстьОбороты", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Нет операций'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);
	
	//выведем колонку подсказки без гиперссылки если нет остатков и оборотов
	Элемент = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(Элемент.Поля, "СверкаСКонтрагентамиНашДолгНетОпераций");
	ГруппаОтбораИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Элемент.Отбор,"ЕстьРасчеты",ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИЛИ,
		"СверкаСКонтрагентами.ЕстьРазвернутыйОстаток", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИЛИ,
		"СверкаСКонтрагентами.ЕстьОбороты", ВидСравненияКомпоновкиДанных.Равно, Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	//Конец НашДолг
	
	
	//Комментарий
	Элемент = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(Элемент.Поля, "СверкаСКонтрагентамиКомментарийКартинка");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(Элемент.Поля, "СверкаСКонтрагентамиКомментарийТекст");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"СверкаСКонтрагентами.Комментарий", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	
	//ЕстьРасхождения
	Элемент = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(Элемент.Поля, "СверкаСКонтрагентамиСтатусСверкиПредставление");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"СверкаСКонтрагентами.ЕстьРасхождения", ВидСравненияКомпоновкиДанных.Равно, Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтрицательногоЗначения);
	
	
	//НеЗавершенОбменЭДОПредставление - Гиперссылка
	Элемент = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(Элемент.Поля, "СверкаСКонтрагентамиНеПолученыДокументыПоЭДО");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"СверкаСКонтрагентами.НеЗавершенОбменЭДОКоличество", ВидСравненияКомпоновкиДанных.Больше, 0);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,,,Истина));
	
	
	//СверкаСКонтрагентамиСверка20 - Гиперссылка
	Элемент = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(Элемент.Поля, "СверкаСКонтрагентамиСверка20");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"СверкаСКонтрагентами.СервисСверкиЕстьРасхождения", ВидСравненияКомпоновкиДанных.Равно, Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Истина);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(Элемент.Поля, "СверкаСКонтрагентамиСверка20");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"СверкаСКонтрагентами.СервисСверкиЕстьРасхождения", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(Элемент.Поля, "СверкаСКонтрагентамиСверкаБезГиперссылки");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"СверкаСКонтрагентами.СервисСверкиЕстьРасхождения", ВидСравненияКомпоновкиДанных.Равно, Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(Элемент.Поля, "СверкаСКонтрагентамиСверкаБезГиперссылки");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"СверкаСКонтрагентами.СервисСверкиЕстьРасхождения", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Истина);
	
КонецПроцедуры

// Параметры:
//  Результат - СтандартныйПериод, Неопределено -
//  ДополнительныеПараметры - Неопределено
//
&НаКлиенте
Асинх Процедура УстановитьИнтервалЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		УстановитьДатуОстатков(Элементы.СверкаСКонтрагентамиГруппаОстатки, Объект.КонецПериода);
		ПриИзмененииНастройки();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДатуОстатков(ГруппаКолонок, ДатаОстатков)
	ГруппаКолонок.Заголовок = НСтр("ru = 'Остаток на'") + ": " + Формат(ДатаОстатков, "ДЛФ=D");
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьБыстрыхОтборов(Кнопка, ГруппаОтборы, НоваяВидимость)
	
	ГруппаОтборы.Видимость = НоваяВидимость;
	Кнопка.Пометка = НоваяВидимость;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСервисов()
	
	ВидимостьЭДО = Ложь;
	ОрганизацияПодключенаКСверка20 = Ложь;
	//++ Локализация
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиОтправкиЭД.Отправитель
	|ИЗ
	|	РегистрСведений.НастройкиОтправкиЭлектронныхДокументов КАК НастройкиОтправкиЭД
	|ГДЕ
	|	НастройкиОтправкиЭД.Отправитель = &Организация
	|;
	|
	|ВЫБРАТЬ 
	|	ОрганизацииБизнесСеть.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
	|ГДЕ
	|	ОрганизацииБизнесСеть.Организация = &Организация
	|	И ОрганизацииБизнесСеть.Идентификатор <> """"";
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ЕстьНастройкаЭДОПоОрганизации = РезультатЗапроса[0].Выбрать().Следующий();
	ИспользуетсяСервисСверкиРасчетов = ПолучитьФункциональнуюОпцию("ИспользуетсяСервисСверкиРасчетов");
	ОрганизацияПодключенаКСверка20 = ИспользуетсяСервисСверкиРасчетов И РезультатЗапроса[1].Выбрать().Следующий();
	
	ЕстьПравоЧтенияДокументов = ИнтерфейсДокументовЭДОВызовСервера.ЕстьПравоЧтенияДокументов();
	
	ВидимостьЭДО = ЕстьНастройкаЭДОПоОрганизации И ЕстьПравоЧтенияДокументов;
	//-- Локализация
	
	Элементы.ОткрытьТекущиеДелаЭДО.Видимость = ВидимостьЭДО;
	Элементы.СверкаСКонтрагентамиЭДОСверки.Видимость = ВидимостьЭДО;
	Элементы.СверкаСКонтрагентамиНеПолученыДокументыПоЭДО.Видимость = ВидимостьЭДО;
	
	Элементы.СверкаСКонтрагентамиГруппаСверка20.Видимость = ОрганизацияПодключенаКСверка20;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыРасчетов()
	
	ОтборТипыРасчетов.Очистить();
	ЗапрещенныеТипыРасчетов = Документы.СверкаВзаиморасчетов2_5_11.ЗапрещенныеТипыРасчетов();
	
	ДобавитьТипРасчетов(Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
	ДобавитьТипРасчетов(Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком);
	
	Если ЗапрещенныеТипыРасчетов.Найти(Перечисления.ТипыРасчетовСПартнерами.РасчетыСКредитором) = Неопределено Тогда
		ДобавитьТипРасчетов(Перечисления.ТипыРасчетовСПартнерами.РасчетыСКредитором);
	КонецЕсли;
	Если ЗапрещенныеТипыРасчетов.Найти(Перечисления.ТипыРасчетовСПартнерами.РасчетыСДебитором) = Неопределено Тогда
		ДобавитьТипРасчетов(Перечисления.ТипыРасчетовСПартнерами.РасчетыСДебитором);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьТипРасчетов(ТипРасчетов, Пометка = Истина);
	
	НоваяСтрока = ОтборТипыРасчетов.Добавить();
	НоваяСтрока.Использование = Пометка;
	НоваяСтрока.ТипРасчетов = ТипРасчетов;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОрганизаций()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Организация,
	|	ДанныеСправочника.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Организации КАК ДанныеСправочника
	|ГДЕ
	|	НЕ ДанныеСправочника.ПометкаУдаления
	|	И ДанныеСправочника.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОрганизацийПодразделений.Действует)
	|	И ДанныеСправочника.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	ДоступныеОрганизации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
	
	Элементы.Организация.СписокВыбора.ЗагрузитьЗначения(ДоступныеОрганизации);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусыСверки()
	
	ОписаниеСтатусовСверки = Обработки.МониторСверкиВзаиморасчетов.СтатусыСверки();
	СтатусЕстьРасхождения = Обработки.МониторСверкиВзаиморасчетов.СтатусЕстьРасхождения();
	
	ОтборСтатусыСверки.Очистить();
	Для Каждого СтатусСверки Из ОписаниеСтатусовСверки Цикл
		
		НоваяСтрока = ОтборСтатусыСверки.Добавить();
		НоваяСтрока.Использование = Истина;
		НоваяСтрока.Имя = СтатусСверки.Имя;
		НоваяСтрока.Представление = СтатусСверки.Представление;
		НоваяСтрока.Картинка = СтатусСверки.Картинка;
		
	КонецЦикла;
	
	Элементы.ЕстьРасхождения.Заголовок = СтатусЕстьРасхождения.Представление;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоСтатусов(ИтогиПоСтатусам)
	
	ОписаниеСтатусов = Обработки.МониторСверкиВзаиморасчетов.СтатусыСверки(Истина);
	Для Каждого Отбор Из ОтборСтатусыСверки Цикл
		Статус = ОписаниеСтатусов[Отбор.Имя];
		Количество = ИтогиПоСтатусам[Отбор.Имя];
		Если ЗначениеЗаполнено(Количество) Тогда
			Отбор.Представление = СтрШаблон("%1 (%2)", Статус.Представление, Количество);
		Иначе
			Отбор.Представление = Статус.Представление;
		КонецЕсли;
	КонецЦикла;
	
	СтатусЕстьРасхождения = Обработки.МониторСверкиВзаиморасчетов.СтатусЕстьРасхождения();
	Количество = ИтогиПоСтатусам[СтатусЕстьРасхождения.Имя];
	Если ЗначениеЗаполнено(Количество) Тогда
		Элементы.ЕстьРасхождения.Заголовок = СтрШаблон("%1 (%2)", СтатусЕстьРасхождения.Представление, Количество);
	Иначе
		Элементы.ЕстьРасхождения.Заголовок = СтатусЕстьРасхождения.Представление;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКомментарийНаСревере(Контрагент, Комментарий)
	
	Набор = РегистрыСведений.КомментарииСверкиВзаиморасчетов.СоздатьНаборЗаписей();
	Набор.Отбор.Организация.Установить(Объект.Организация);
	Набор.Отбор.Контрагент.Установить(Контрагент);
	Если ЗначениеЗаполнено(Комментарий) Тогда
		Запись = Набор.Добавить();
		Запись.Организация = Объект.Организация;
		Запись.Контрагент = Контрагент;
		Запись.Комментарий = Комментарий;
	КонецЕсли;
	Набор.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыОтправкиПисьмаНаСервере(ПараметрыОтправкиПисьма, ИдентификаторТекущейСтроки)
	
	ТекущиеДанные = СверкаСКонтрагентами.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	
	Получатели = АдресаЭлектроннойПочты(ТекущиеДанные.Контрагент);
	
	Если Получатели.Количество() = 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для контрагента %1 не указан адрес электронной почты'"),
			Строка(ТекущиеДанные.Контрагент));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыОтправкиПисьма.Получатель = Получатели;
	
	СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, ТекущаяДатаСеанса());
	ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, 
								"ПолноеНаименование");
	СведенияОКонтрагенте  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ТекущиеДанные.Контрагент, ТекущаяДатаСеанса());
	ПредставлениеКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, 
							  "ПолноеНаименование");
	
	ПараметрыОтправкиПисьма.Тема = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Сверка расчетов между %1 и %2'"),
		ПредставлениеОрганизации,
		ПредставлениеКонтрагента);
		
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Добрый день.
		|Предлагаем провести сверку расчетов между %1 и %2 с %3 по %4.
		|Просьба прислать акт сверки расчетов исходя из ваших учетных данных.'"),
		ПредставлениеОрганизации, ПредставлениеКонтрагента,
		Формат(Объект.НачалоПериода, "ДЛФ=D"), Формат(Объект.КонецПериода, "ДЛФ=D"));
	
	ПараметрыОтправкиПисьма.Текст = ТекстСообщения;
	
КонецПроцедуры

&НаСервере
Функция АдресаЭлектроннойПочты(Контрагент)
	
	Получатели = Новый Массив;
	
	ТипыКИ = Новый Массив;
	ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	Объекты = Новый Массив();
	Объекты.Добавить(Контрагент);
	АдресаПолучателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(Объекты, ТипыКИ, , ТекущаяДатаСеанса());
	
	КонтрагентНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Наименование");
	
	Для каждого АдресПолучателя Из АдресаПолучателя Цикл

		ПараметрыПолучателя = НовыеПараметрыПолучателя();
		ПараметрыПолучателя.ИсточникКонтактнойИнформации = Контрагент;
		ПараметрыПолучателя.Адрес = АдресПолучателя.Представление;
		ПараметрыПолучателя.Представление = КонтрагентНаименование;
		Получатели.Добавить(ПараметрыПолучателя);

	КонецЦикла;
		
	Возврат Получатели;
	
КонецФункции

&НаСервере
Функция НовыеПараметрыПолучателя()
	
	Результат = Новый Структура;
	Результат.Вставить("Выбран"                      , Ложь);
	Результат.Вставить("ИсточникКонтактнойИнформации", Справочники.Контрагенты.ПустаяСсылка());
	Результат.Вставить("Адрес"                       , "");
	Результат.Вставить("Представление"               , "");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииНастройки()
	
	Если АвтообновлениеСпискаПриИзмененииНастроек Тогда
		ОтключитьОбработчикОжидания("ЗаполнитьПоДаннымРасчетовСОжиданием");
		ПодключитьОбработчикОжидания("ЗаполнитьПоДаннымРасчетовСОжиданием", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОткрытьВедомостьРасчетов(Элемент, ТекущаяСтрока)
	
	ИменаОтчетов = Новый Соответствие;
	ИменаОтчетов.Вставить("1", ОтчетыРасшифровки[0]);//ВедомостьРасчетовСКлиентами
	ИменаОтчетов.Вставить("2", ОтчетыРасшифровки[1]);//ВедомостьРасчетовСПоставщиками
	ИменаОтчетов.Вставить("3", ОтчетыРасшифровки[2]);//ВедомостьРасчетовПоФинансовымИнструментам
	ИменаОтчетов.Вставить("4", ОтчетыРасшифровки[2]);//ВедомостьРасчетовПоФинансовымИнструментам
	ИменаОтчетов.Вставить("5", ОтчетыРасшифровки[2]);//ВедомостьРасчетовПоФинансовымИнструментам
	ИменаОтчетов.Вставить("6", ОтчетыРасшифровки[4]);//ВедомостьРасчетовСПартнерами
	
	КодТипРасчетов = СтрЗаменить(ТекущаяСтрока.КодТипРасчетов,"21","6");
	ВыборОтчетов = Новый СписокЗначений;
	Для Индекс = 1 По СтрДлина(КодТипРасчетов) Цикл
		Номер = Сред(КодТипРасчетов, Индекс, 1);
		Отчет = ИменаОтчетов[Номер];
		Если Отчет <> Неопределено Тогда
			ВыборОтчетов.Вставить(0, Отчет.Значение, Отчет.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Период = Новый СтандартныйПериод;
	Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Период.ДатаНачала = Объект.НачалоПериода;
	Период.ДатаОкончания = Объект.КонецПериода;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Новый Структура);
	ПараметрыФормы.Отбор.Вставить("Период", Период);
	ПараметрыФормы.Отбор.Вставить("Организация", Объект.Организация);
	ЭтоНашаОрганизация = ТипЗнч(ТекущаяСтрока.Контрагент) = Тип("СправочникСсылка.Организации");
	Если НЕ ЭтоНашаОрганизация Тогда
		ПараметрыФормы.Отбор.Вставить("Партнер", ПартнерКонтрагента(ТекущаяСтрока.Контрагент));
	КонецЕсли;
	Если НЕ ИспользоватьПартнеровКакКонтрагентов Тогда
		ПараметрыФормы.Отбор.Вставить("Контрагент", ТекущаяСтрока.Контрагент);
	КонецЕсли;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ИмяОтчета = Неопределено;
	Если ЭтоНашаОрганизация Тогда
		ИмяОтчета = "ВедомостьРасчетовМеждуОрганизациями";
		ПараметрыФормы.Отбор.Вставить("Продавец", Объект.Организация);
		ПараметрыФормы.Отбор.Вставить("Покупатель", ТекущаяСтрока.Контрагент);
		Если КодТипРасчетов = "1" Тогда
			ПараметрыФормы.Вставить("КлючВарианта", "РасчетыПоПродажам");
		ИначеЕсли КодТипРасчетов = "2" Тогда
			ПараметрыФормы.Вставить("КлючВарианта", "РасчетыПоЗакупкам");
		КонецЕсли;
		ПараметрыФормы.Отбор.Удалить("Организация");
		ПараметрыФормы.Отбор.Удалить("Контрагент");
	ИначеЕсли ВыборОтчетов.Количество() = 1 Тогда
		ИмяОтчета = ВыборОтчетов[0].Значение;
	ИначеЕсли ВыборОтчетов.Количество() > 1 Тогда
		Ответ = Ждать ВыбратьИзМенюАсинх(ВыборОтчетов, Элемент);
		Если Ответ <> Неопределено Тогда
			ИмяОтчета = Ответ.Значение;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяОтчета <> Неопределено Тогда
		ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПартнерКонтрагента(Контрагент)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Партнер");
КонецФункции

#Область ЗаполнениеДанныхМонитора

&НаКлиенте
Процедура ЗаполнитьПоДаннымРасчетов(ТихийРежим = Истина, Контрагент = Неопределено)
	
	ОчиститьСообщения();
	Результат = ЗаполнитьПоДаннымРасчетовНаСервере(ТихийРежим, Контрагент);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ЗаполнитьПоДаннымРасчетовЗавершение",
		ЭтотОбъект,
		Контрагент);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Результат, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымРасчетовСОжиданием() Экспорт
	ЗаполнитьПоДаннымРасчетов();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымРасчетовЗавершение(Результат, Контрагент) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения = ЗагрузитьПодготовленныеДанные(Результат, Контрагент);
	
	Если НЕ РезультатВыполнения.Успешно Тогда
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПоДаннымРасчетовНаСервере(ТихийРежим = Истина, Контрагент = Неопределено)
	
	// Проверим заполненность обязательных реквизитов
	Если НЕ ПроверитьЗаполнение() Тогда
		Если ТихийРежим Тогда
			// Скроем сообщения об ошибках заполнения
			ПолучитьСообщенияПользователю(Истина);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПустаяСтрока(Сортировать) Тогда
		Сортировать = "КонтрагентНаименование";
	КонецЕсли;
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
	ИдентификаторЗадания = Неопределено;
	
	ПараметрыСверки = Новый Структура;
	
	ПараметрыСверки.Вставить("НачалоПериода", Объект.НачалоПериода);
	ПараметрыСверки.Вставить("КонецПериода", КонецДня(Объект.КонецПериода));
	ПараметрыСверки.Вставить("Организация", Объект.Организация);
	ПараметрыСверки.Вставить("Контрагент", СписокКонтрагентов.ВыгрузитьЗначения());
	ПараметрыСверки.Вставить("Менеджер", Менеджер);
	ПараметрыСверки.Вставить("ВключатьДоговорыБезОборотов", ВключатьДоговорыБезОборотов);
	ПараметрыСверки.Вставить("ЕстьРасхождения", ЕстьРасхождения);
	ПараметрыСверки.Вставить("ТолькоНашиОрганизации", ЭтоНашаОрганизация);
	
	ТипыРасчетов = Новый Массив;
	Для Каждого Отбор Из ОтборТипыРасчетов Цикл
		Если Отбор.Использование Тогда
			ТипыРасчетов.Добавить(Отбор.ТипРасчетов);
		КонецЕсли;
	КонецЦикла;
	ПараметрыСверки.Вставить("ТипыРасчетов", ТипыРасчетов);
	
	СтатусыСверки = Новый Соответствие;
	Для Каждого Отбор Из ОтборСтатусыСверки Цикл
		СтатусыСверки.Вставить(Отбор.Имя, Отбор.Использование);
	КонецЦикла;
	ПараметрыСверки.Вставить("СтатусыСверки", СтатусыСверки);
	
	ПараметрыСверки.Вставить("Сортировать", Сортировать);
	ПараметрыСверки.Вставить("ВсеПоляСортировки", Элементы.Сортировать.СписокВыбора.ВыгрузитьЗначения());
	
	Если ЭтоАдресВременногоХранилища(АдресОшибокВыполнения) Тогда
		УдалитьИзВременногоХранилища(АдресОшибокВыполнения);
		АдресОшибокВыполнения = "";
	КонецЕсли;
	
	АдресОшибокВыполнения = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ПараметрыСверки.Вставить("АдресОшибокВыполнения", АдресОшибокВыполнения);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "ЗаполнитьКонтрагентовДляСверки";
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.МониторСверкиВзаиморасчетов.ПолучитьДанныеСверки",
		ПараметрыСверки,
		ПараметрыВыполнения);
	
	ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗагрузитьПодготовленныеДанные(Результат, Контрагент)
	
	ДанныеСверки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ЗаданиеВыполнено", Истина);
	РезультатВыполнения.Вставить("Успешно", Ложь);
	
	Если ТипЗнч(ДанныеСверки) <> Тип("Структура") Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	РезультатВыполнения.Успешно = Истина;
	
	СверкаСКонтрагентами.Загрузить(ДанныеСверки.Контрагенты);
	
	ПроцентПодтвержденоДолгКонтрагента = 0;
	ДолгКонтрагента = ДанныеСверки.ИтогиЗадолженности.ДолгКонтрагента;
	Если ДолгКонтрагента.Всего > 0 Тогда
		ПроцентПодтвержденоДолгКонтрагента = Окр(ДолгКонтрагента.Сверено / ДолгКонтрагента.Всего * 100, 0);
	КонецЕсли;
	
	ПроцентПодтвержденоНашДолг = 0;
	НашДолг = ДанныеСверки.ИтогиЗадолженности.НашДолг;
	Если НашДолг.Всего > 0 Тогда
		ПроцентПодтвержденоНашДолг = Окр(НашДолг.Сверено / НашДолг.Всего * 100, 0);
	КонецЕсли;
	
	ЗаполнитьКоличествоСтатусов(ДанныеСверки.ИтогиПоСтатусамСверки);
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура СоздатьДокументСверкиВзаиморасчетов()
	
	ОчиститьСообщения();
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.СверкаСКонтрагентами.ТекущиеДанные;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
	Если ТекущаяСтрока <> Неопределено Тогда
		ЗначенияЗаполнения.Вставить("Контрагент", ТекущаяСтрока.Контрагент);
	КонецЕсли;
	ЗначенияЗаполнения.Вставить("НачалоПериода", Объект.НачалоПериода);
	ЗначенияЗаполнения.Вставить("КонецПериода", Объект.КонецПериода);
	ПоДоговорам = ПредопределенноеЗначение("Перечисление.РежимСверкиИтоговВзаиморасчетов.ПоДоговорам");
	ЗначенияЗаполнения.Вставить("РежимСверкиИтоговВзаиморасчетов", ПоДоговорам);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.СверкаВзаиморасчетов2_5_11.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура УстановитьСтатусСверки(ИмяСтатуса)
	
	ОчиститьСообщения();
	ТекущаяСтрока = Элементы.СверкаСКонтрагентами.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбран контрагент'"));
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.СтатусСверки = "ТребуетсяСверка" Тогда
		Если ИмяСтатуса = "Отклонена" Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нет созданных документов сверки'"));
			Возврат;
		КонецЕсли;
		
		ТекстВопроса = НСтр("ru = 'Для контрагента ""%1"" требуется создать документ сверки.
		|Создать?'");
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%1", ТекущаяСтрока.КонтрагентНаименование);
		Ответ = Ждать ВопросАсинх(ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			СоздатьДокументСверкиВзаиморасчетов();
		КонецЕсли;
		
	Иначе
		Статус = Строка(ПредопределенноеЗначение("Перечисление.СтатусыСверокВзаиморасчетов2_5_11."+ИмяСтатуса));
		ТекстВопроса = СтрЗаменить(ТекстВопросаУстановкиСтатуса(), "%1", Статус);
		Ответ = Ждать ВопросАсинх(ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			УстановитьСтатусСверкиНаСервере(ИмяСтатуса, ТекущаяСтрока.Контрагент);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ТекстВопросаУстановкиСтатуса()
	
	Возврат НСтр("ru = 'Для всех документов сверки по выбранному контрагенту, за выбранный период будет установлен статус ""%1"".
	|Продолжить?'");
	
КонецФункции

&НаСервере
Процедура УстановитьСтатусСверкиНаСервере(ИмяСтатуса, Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СверкаВзаиморасчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СверкаВзаиморасчетов2_5_11 КАК СверкаВзаиморасчетов
	|ГДЕ
	|	СверкаВзаиморасчетов.Проведен
	|	И СверкаВзаиморасчетов.Организация = &Организация
	|	И СверкаВзаиморасчетов.Контрагент = &Контрагент
	|	И СверкаВзаиморасчетов.НачалоПериода <= &КонецПериода
	|	И СверкаВзаиморасчетов.КонецПериода >= &НачалоПериода";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Объект.КонецПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СверкаОбъект = Выборка.Ссылка.ПолучитьОбъект();// ДокументОбъект.СверкаВзаиморасчетов2_5_11 -
		СверкаОбъект.Статус = Перечисления.СтатусыСверокВзаиморасчетов2_5_11[ИмяСтатуса];
		СверкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
